module CS.Lab3 where

import ReportBase

import Text.LaTeX.Packages.AMSMath
import Text.LaTeX.Packages.Graphicx

writeReport :: IO ()
writeReport = renderFile "./renders/CS-Lab3.tex" (execLaTeXM reportTeX)

reportTeX :: LaTeXM ()
reportTeX = do
  baseHeader
  -- https://tex.stackexchange.com/a/157400
  raw "\\usepackage{array}\\newcolumntype{P}[1]{>{\\centering\\arraybackslash}p{#1}}"
  raw "\\usepackage{adjustbox}"
  document $ do
    baseTitlePage ("ЛАБОРАТОРНАЯ РАБОТА №3", "Основы вычислительной техники", Just "Вариант 987", "2017 г.")
    sectionstar "Цель работы"
    "Изучение способов организации циклических программ и исследование порядка функционирования БЭВМ при выполнении циклических программ."
    sectionstar "Порядок выполнения работы"
    "Восстановить текст заданного варианта программы, определить предназначение и составить описание программы, определить область представления и область допустимых значений исходных данных и результата, выполнить трассировку программы."
    sectionstar "Содержание памяти"
    includegraphics [IGWidth (Cm 6)] "../src/CS/Lab3Code.png"
    sectionstar "Исходный текст программы"
    tabular Nothing [VerticalLine, LeftColumn, VerticalLine, LeftColumn, VerticalLine, LeftColumn, VerticalLine, ParColumnTop "10cm", VerticalLine] $ do
      hline
      trow [textbf "Адрес", textbf "Код", textbf "Мнемоника", textbf "Комментарии"]
      trow ["4D6", "04EA", "A", "Адрес первого элемента массива"]
      trow ["4D7", "0005", "N", "Число элементов в массиве"]
      trow ["4D8", "F300", "R", "Ячейка для накопления результата"]
      tfreerow [textbf "4D9 +", textbf "F200", textbf "CLA", multirow 2 Nothing $ textbf "Начало программы. " <> "Обнулить R"] >> cline 1 3
      trow ["4DA", "34D8", "MOV 4D8", ""]
      tfreerow ["4DB", "44D7", "ADD 4D7", multirow 4 (Just $ Cm 10) "В индексную ячейку 00С записать отрицательное значение числа элементов в массиве (изначательное значение счетчика итераций)"] >> cline 1 3
      tfreerow ["4DC", "F400", "CMA", ""] >> cline 1 3
      tfreerow ["4DD", "F800", "INC", ""] >> cline 1 3
      trow ["4DE", "300C", "MOV 00C", ""]
      tfreerow ["4DF", "F200", "CLA", multirow 3 (Just $ Cm 10) "В индексную ячейку 00D записать адрес первого элемента массива"] >> cline 1 3
      tfreerow ["4E0", "44D6", "ADD 4D6", ""] >> cline 1 3
      trow ["4E1", "300D", "MOV 00D", ""]
      tfreerow ["4E2", "F200", "CLA", multirow 2 (Just $ Cm 10) $ textbf "Начало цикла. " <> "A присвоить следующий, начиная с первого, элемент массива"] >> cline 1 3
      trow ["4E3", "480D", "ADD (00D)", ""]
      trow ["4E4", "B4E7", "BEQ 4E7", "Пропустить следующие две операции, если элемент массива равен нулю"]
      trow ["4E5", "64D8", "SUB 4D8", "Отнять R от элемента массива"]
      trow ["4E6", "34D8", "MOV 4D8", "Записать результат обратно в R"]
      tfreerow ["4E7", "000C", "ISZ 00C", multirow 2 (Just $ Cm 10) "Прибавить 1 к счетчику итераций и перейти в начало цикла, если его значение меньше нуля"] >> cline 1 3
      trow ["4E8", "C4E2", "BR 4E2", ""]
      trow [textbf "4E9 -", textbf "F000", textbf "HLT", textbf "Конец программы." <> " Остановить ЭВМ"]
      tfreerow ["4EA", "F400", math $ raw "A_1", multirow 5 (Just $ Cm 10) "Значения элементов массива"] >> cline 1 3
      tfreerow ["4EB", "0000", math $ raw "A_2", ""] >> cline 1 3
      tfreerow ["4EC", "54DC", math $ raw "A_3", ""] >> cline 1 3
      tfreerow ["4ED", "F800", math $ raw "A_4", ""] >> cline 1 3
      trow ["4EE", "54E6", math $ raw "A_5", ""]
    sectionstar "Описание программы"
    raw "\\noindent\n" >> "Программа вычисляет значение " <> math "R" <> ", которое определяется следующим образом: "
    flalignstar $ do
      raw "&R = F_{N'}" >> lnbk
      raw "&F_i = A'_i - F_{i-1}" >> lnbk
      raw "&F_1 = A'_1"
    "(где " <> math "N'" <> " -- число " <> textit "ненулевых" <> " элементов в массиве, " <> math (raw "A'_i") <> " -- " <> math "i" <> "-й элемент массива " <> textit "ненулевых" <> " элементов, " <> math "i" <> " изменяется от 1 до " <> math "N'" <> ")" >> parbreak >> vspace (Mm 4)
    "Формула сводится к нахождению разности между элементами массива с четными и нечетными индексами, если число " <> textit "неотрицательных" <> " элементов четно, и в противном случае наоборот. Таким образом, ее можно сократить до следующей формы:"
    mathDisplay $ do
      raw "(-1)^{(N' mod 2)} \\sum_{n=1}^{\\lfloor \\frac{N'}{2} \\rfloor} A'_{2n} - \\sum_{n=1}^{\\lceil \\frac{N'}{2} \\rceil} A'_{2n-1}"
    "Результат и элементы массива представлены знаковыми числами. Область допустимых значений каждого следующего элемента зависит от предыдущих и может быть в общем виде выражена как: "
    mathDisplay $ cases $ do
      raw "-2^{15} \\leqslant A'_i - (A'_{i -1} - (A'_{i - 2} \\dotsc)) \\leqslant 2^{15}-1, & 3 \\leqslant i \\leqslant N'" >> lnbk
      raw "-2^{15} \\leqslant A'_2 - A'_1 \\leqslant 2^{15} - 1, & i = 2" >> lnbk
      raw "-2^{15} \\leqslant A'_1 \\leqslant 2^{15} - 1, & i = 1"
    "Стоит отметить, что cуществует такая область значений отдельного элемента, что ошибка переполнения в результате выполнения программы не возникнет независимо от значений других элементов:"
    mathDisplay $ raw "-2^{15 - \\lceil \\frac{N'}{2} \\rceil} \\leqslant A'i \\leqslant 2^{15 - \\lceil \\frac{N'}{2} \\rceil} - 1"
    "В случае, когда число ненулевых элементов равно 1, применимо общее выражение ОДЗ для знаковых чисел, " <> math (raw "-2^{15} \\leqslant A'_1 \\leqslant 2^{15} - 1") <> "." >> parbreak >> vspace (Mm 4)
    "Можно заметить, что при " <> math (raw "N' \\geqslant 29") <> " подобная область отсутствует; допустимое значение отдельного элемента зависит от предшествующих ему, см. выше." >> parbreak >> vspace (Mm 4)
    "Область допустимых значений адреса первого элемента массива и числа элементов массива зависят от возможного размещения исходных данных; об этом см. ниже."
    sectionstar "Размещение исходных данных в памяти"
    "Адреса 4D6-4D8 содержат адрес первого элемента массива, число элементов в массиве и результат соответственно." >> parbreak
    "Адреса 4D9-4E9 содержат исполняемые команды, т.е. саму программу." >> parbreak >> vspace (Mm 4)
    "На расположение исходных данных в памяти существует несколько ограничений: количество доступных ячеек в БЭВМ, невозможность использовать зарезервированные программой адреса (см. выше), а также необходимость распологать элементы друг за другом непрерывно." >> lnbk
    "Таким образом, возможно три варианта размещения исходного массива: 000-00C (до 13 элементов), 00E-4D5 (до 1224 элементов), 4EA-7FF (?)."

-- bpc emu commands:
-- 4d6 a 04ea w 0005 w f300 w
-- f200 w 34d8 w 44d7 w f400 w f800 w
-- 300c w f200 w 44d6 w 300d w f200 w
-- 480d w b4e7 w 64d8 w 34d8 w 000c w
-- c4e2 w f000 w
-- f400 w 0000 w 54dc w f800 w 54e6 w
    
    sectionstar "Таблица трассировки"
    raw "\\begin{adjustbox}{center}"
    raw "\\begin{tabular}{| P{1.6cm} | c | c | c | c | c | c | c | P{2.6cm} | P{3.2cm} |}\\hline \
      \\\multicolumn{2}{|P{4cm}}{\\textbf{Выполняемая \\linebreak команда}}\
      \& \\multicolumn{6}{|P{7.2cm}}{\\textbf{Содержимое регистров процессора после выполнения команды}}\
      \& \\multicolumn{2}{|P{6cm}|}{\\textbf{Ячейка, содержимое которой изменилось после выполнения команды}} \\\\" >> hline 
    "Адрес" & "Код" & "СК" & "РА" & "РК" & "РД" & "А" & "С" & "Адрес" & "Новый код" >> lnbk >> hline
    
    "4D9" & "F200" & "4DA" & "4D9" & "F200" & "F200" & "0000" & "0" & "" & "" >> lnbk >> hline
    "4DA" & "34D8" & "4DB" & "4D8" & "34D8" & "0000" & "0000" & "0" & "4D8" & "0000" >> lnbk >> hline
    "4DB" & "44D7" & "4DC" & "4D7" & "44D7" & "0005" & "0005" & "0" & "" & "" >> lnbk >> hline
    "4DC" & "F400" & "4DD" & "4DC" & "F400" & "F400" & "FFFA" & "0" & "" & "" >> lnbk >> hline
    "4DD" & "F800" & "4DE" & "4DD" & "F800" & "F800" & "FFFB" & "0" & "" & "" >> lnbk >> hline
    "4DE" & "300C" & "4DF" & "00C" & "300C" & "FFFB" & "FFFB" & "0" & "00C" & "FFFB" >> lnbk >> hline
    "4DF" & "F200" & "4E0" & "4DF" & "F200" & "F200" & "0000" & "0" & "" & "" >> lnbk >> hline
    "4E0" & "44D6" & "4E1" & "4D6" & "44D6" & "04EA" & "04EA" & "0" & "" & "" >> lnbk >> hline
    "4E1" & "300D" & "4E2" & "00D" & "300D" & "04EA" & "04EA" & "0" & "00D" & "04EA" >> lnbk >> hline
    textbf "4E2" & "F200" & "4E3" & "4E2" & "F200" & "F200" & "0000" & "0" & "" & "" >> lnbk >> hline
    "4E3" & "480D" & "4E4" & "4EA" & "480D" & "F400" & "F400" & "0" & "00D" & "04EB" >> lnbk >> hline
    "4E4" & "B4E7" & "4E5" & "4E4" & "B4E7" & "B4E7" & "F400" & "0" & "" & "" >> lnbk >> hline
    "4E5" & "64D8" & "4E6" & "4D8" & "64D8" & "0000" & "F400" & "1" & "" & "" >> lnbk >> hline
    "4E6" & "34D8" & "4E7" & "4D8" & "34D8" & "F400" & "F400" & "1" & "4D8" & "F400" >> lnbk >> hline
    "4E7" & "000C" & "4E8" & "00C" & "000C" & "FFFC" & "F400" & "1" & "00C" & "FFFC" >> lnbk >> hline
    "4E8" & "C4E2" & "4E2" & "4E8" & "C4E2" & "C4E2" & "F400" & "1" & "" & "" >> lnbk >> hline
    textbf "4E2" & "F200" & "4E3" & "4E2" & "F200" & "F200" & "0000" & "1" & "" & "" >> lnbk >> hline
    "4E3" & "480D" & "4E4" & "4EB" & "480D" & "0000" & "0000" & "0" & "00D" & "04EC" >> lnbk >> hline
    "4E4" & "B4E7" & "4E7" & "4E4" & "B4E7" & "B4E7" & "0000" & "0" & "" & "" >> lnbk >> hline
    "4E7" & "000C" & "4E8" & "00C" & "000C" & "FFFD" & "0000" & "0" & "00C" & "FFFD" >> lnbk >> hline
    "4E8" & "C4E2" & "4E2" & "4E8" & "C4E2" & "C4E2" & "0000" & "0" & "" & "" >> lnbk >> hline
    textbf "4E2" & "F200" & "4E3" & "4E2" & "F200" & "F200" & "0000" & "0" & "" & "" >> lnbk >> hline
    "4E3" & "480D" & "4E4" & "4EC" & "480D" & "54DC" & "54DC" & "0" & "00D" & "04ED" >> lnbk >> hline
    "4E4" & "B4E7" & "4E5" & "4E4" & "B4E7" & "B4E7" & "54DC" & "0" & "" & "" >> lnbk >> hline
    "4E5" & "64D8" & "4E6" & "4D8" & "64D8" & "F400" & "60DC" & "0" & "" & "" >> lnbk >> hline
    "4E6" & "34D8" & "4E7" & "4D8" & "34D8" & "60DC" & "60DC" & "0" & "4D8" & "60DC" >> lnbk >> hline
    "4E7" & "000C" & "4E8" & "00C" & "000C" & "FFFE" & "60DC" & "0" & "00C" & "FFFE" >> lnbk >> hline
    "4E8" & "C4E2" & "4E2" & "4E8" & "C4E2" & "C4E2" & "60DC" & "0" & "" & "" >> lnbk >> hline
    textbf "4E2" & "F200" & "4E3" & "4E2" & "F200" & "F200" & "0000" & "0" & "" & "" >> lnbk >> hline
    "4E3" & "480D" & "4E4" & "4ED" & "480D" & "F800" & "F800" & "0" & "00D" & "04EE" >> lnbk >> hline
    "4E4" & "B4E7" & "4E5" & "4E4" & "B4E7" & "B4E7" & "F800" & "0" & "" & "" >> lnbk >> hline
    "4E5" & "64D8" & "4E6" & "4D8" & "64D8" & "60DC" & "9724" & "1" & "" & "" >> lnbk >> hline
    "4E6" & "34D8" & "4E7" & "4D8" & "34D8" & "9724" & "9724" & "1" & "4D8" & "9724" >> lnbk >> hline
    "4E7" & "000C" & "4E8" & "00C" & "000C" & "FFFF" & "9724" & "1" & "00C" & "FFFF" >> lnbk >> hline
    "4E8" & "C4E2" & "4E2" & "4E8" & "C4E2" & "C4E2" & "9724" & "1" & "" & "" >> lnbk >> hline
    textbf "4E2" & "F200" & "4E3" & "4E2" & "F200" & "F200" & "0000" & "1" & "" & "" >> lnbk >> hline
    "4E3" & "480D" & "4E4" & "4EE" & "480D" & "54E6" & "54E6" & "0" & "00D" & "04EF" >> lnbk >> hline
    "4E4" & "B4E7" & "4E5" & "4E4" & "B4E7" & "B4E7" & "54E6" & "0" & "" & "" >> lnbk >> hline
    "4E5" & "64D8" & "4E6" & "4D8" & "64D8" & "9724" & "BDC2" & "0" & "" & "" >> lnbk >> hline
    "4E6" & "34D8" & "4E7" & "4D8" & "34D8" & "BDC2" & "BDC2" & "0" & "4D8" & "BDC2" >> lnbk >> hline
    "4E7" & "000C" & "4E9" & "00C" & "000C" & "0000" & "BDC2" & "0" & "00C" & "0000" >> lnbk >> hline
    "4E9" & "F000" & "4EA" & "4E9" & "F000" & "F000" & "BDC2" & "0" & "" & "" >> lnbk >> hline

    raw "\\end{tabular}"
    raw "\\end{adjustbox}"
