module CS.Lab5 where

import ReportBase

writeReport :: IO ()
writeReport = renderFile "./renders/CS-Lab5.tex" (execLaTeXM reportTeX)

reportTeX :: LaTeXM ()
reportTeX = do
  baseHeader
  raw "\\usepackage{array}\\newcolumntype{P}[1]{>{\\centering\\arraybackslash}p{#1}}"
  raw "\\input{../src/CS/Lab5Head.latex}"
  document $ do
    baseTitlePage ("ЛАБОРАТОРНАЯ РАБОТА №5", "Основы вычислительной техники", Just "Вариант 92266", "2017 г.")
    sectionstar "Цель работы"
    "Изучение организации системы ввода-вывода базовой ЭВМ, команд ввода-вывода и исследование процесса функционирования ЭВМ при обмене данными по сигналам готовности внешних устройств (ВУ)."
    sectionstar "Задание"
    enumerate $ do
      item Nothing <> "Программа осуществляет асинхронный вывод данных на ВУ-3."
      item Nothing <> raw "Программа начинается с адреса $561_{16}$. Размещаемая строка находится по адресу $651_{16}$. Для реализации чтения или записи строки необходимо использовать индексную ячейку $A_{16}$."
      item Nothing <> "Строка должна быть представлена в кодировке ISO-8859-5."
      item Nothing <> "Формат представления строки в памяти: АДР0: ДЛИНА АДР1: СИМВ2 СИМВ1 АДР2: СИМВ4 СИМВ3 ..., где ДЛИНА - 16 разрядное слово, где значащими являются 8 младших бит."
      item Nothing <> "Вывод строки начинается со ввода количества символов (1 байт), и должен быть завершен по выводу их необходимого количества."
    sectionstar "Листинг программы"
    raw "\\input{../src/CS/Lab5Listing.latex}"
    sectionstar "Ограничения"
    raw "Количество символов в строке, хранимое в памяти и вводимое пользователем, является 8-разрядным беззнаковым числом, принимающим значения от 1 до 255. Каждый символ содержит 8 бит, при этом кириллическим символам в кодировке ISO-8859-5 отведены значения с A0 по FF. Младшие 7 бит соответствуют таблице ASCII, где $0_{16}$-$1F_{16}$ отведены под специальные символы; соответственно, выводимые значения находятся в диапазоне от $20_{16}$ до $7E_{16}$, $A0_{16}$-$FF_{16}$." <> lnbk <> parbreak
    raw "Так как длина строки ограничена 255, она может занимать ячейки с $651_{16}$ по $6D2_{16}$, где первая ячейка отведена под длину."
    newpage
    sectionstar "Таблица трассировки"
    -- Copy-pasted from earlier labs, not sure how to redo the P macro in borderedtable
    raw "\\begin{adjustbox}{center}"
    raw "\\begin{tabular}{| P{1.6cm} | c | c | c | c | c | c | c | P{2.6cm} | P{3.2cm} |}\\hline \
      \\\multicolumn{2}{|P{4cm}}{\\textbf{Выполняемая \\linebreak команда}}\
      \& \\multicolumn{6}{|P{7.2cm}}{\\textbf{Содержимое регистров процессора после выполнения команды}}\
      \& \\multicolumn{2}{|P{6cm}|}{\\textbf{Ячейка, содержимое которой изменилось после выполнения команды}} \\\\" >> hline 
    "Адрес" & "Код" & "СК" & "РА" & "РК" & "РД" & "А" & "С" & "Адрес" & "Новый код" >> lnbk >> hline
    trow ["562", "4650", "563", "650", "4650", "0652", "0652", "0", "", ""]
    trow ["563", "300A", "564", "00A", "300A", "0652", "0652", "0", "00A", "0652"]
    trow ["564", "F200", "565", "564", "F200", "F200", "0000", "0", "", ""]
    trow ["565", "2585", "586", "585", "2586", "0566", "0000", "0", "585", "0566"]
    trow ["586", "E103", "587", "586", "E103", "E103", "0000", "0", "", ""]
    trow ["587", "C586", "586", "587", "C586", "C586", "0000", "0", "", ""]
    trow ["586", "E103", "587", "586", "E103", "E103", "0000", "0", "", ""]
    trow ["587", "C586", "586", "587", "C586", "C586", "0000", "0", "", ""]
    trow ["586", "E103", "588", "586", "E103", "E103", "0000", "0", "", ""]
    trow ["588", "E203", "589", "588", "E203", "E203", "0002", "0", "", ""]
    trow ["589", "E003", "58A", "589", "E003", "E003", "0002", "0", "", ""]
    trow ["58A", "CD85", "566", "585", "CD85", "0566", "0002", "0", "", ""]
    trow ["566", "6651", "567", "651", "6651", "0007", "FFFB", "0", "", ""]
    trow ["567", "A569", "569", "567", "A569", "A569", "FFFB", "0", "", ""]
    trow ["569", "4651", "56A", "651", "4651", "0007", "0002", "1", "", ""]
    trow ["56A", "F400", "56B", "56A", "F400", "F400", "FFFD", "1", "", ""]
    trow ["56B", "F800", "56C", "56B", "F800", "F800", "FFFE", "0", "", ""]
    trow ["56C", "300B", "56D", "00B", "300B", "FFFE", "FFFE", "0", "00B", "FFFE"]
    trow ["56D", "F200", "56E", "56D", "F200", "F200", "0000", "0", "", ""]
    trow ["56E", "480A", "56F", "652", "480A", "5336", "5336", "0", "00A", "0653"]
    trow ["56F", "257F", "580", "57F", "2580", "0570", "5336", "0", "57F", "0570"]
    trow ["580", "E103", "581", "580", "E103", "E103", "5336", "0", "", ""]
    trow ["581", "C580", "580", "581", "C580", "C580", "5336", "0", "", ""]
    trow ["580", "E103", "582", "580", "E103", "E103", "5336", "0", "", ""]
    trow ["582", "E303", "583", "582", "E303", "E303", "5336", "0", "", ""]
    trow ["583", "E003", "584", "583", "E003", "E003", "5336", "0", "", ""]
    trow ["584", "CD7F", "570", "57F", "CD7F", "0570", "5336", "0", "", ""]
    trow ["570", "000B", "571", "00B", "000B", "FFFF", "5336", "0", "00B", "FFFF"]
    trow ["571", "C573", "573", "571", "C573", "C573", "5336", "0", "", ""]
    trow ["573", "F700", "574", "573", "F700", "F700", "299B", "0", "", ""]
    trow ["574", "F700", "575", "574", "F700", "F700", "14CD", "1", "", ""]
    trow ["575", "F700", "576", "575", "F700", "F700", "8A66", "1", "", ""]
    trow ["576", "F700", "577", "576", "F700", "F700", "C533", "0", "", ""]
    trow ["577", "F700", "578", "577", "F700", "F700", "6299", "1", "", ""]
    trow ["578", "F700", "579", "578", "F700", "F700", "B14C", "1", "", ""]
    trow ["579", "F700", "57A", "579", "F700", "F700", "D8A6", "0", "", ""]
    trow ["57A", "F700", "57B", "57A", "F700", "F700", "6C53", "0", "", ""]
    trow ["57B", "257F", "580", "57F", "2580", "057C", "6C53", "0", "57F", "057C"]
    trow ["580", "E103", "581", "580", "E103", "E103", "6C53", "0", "", ""]
    trow ["581", "C580", "580", "581", "C580", "C580", "6C53", "0", "", ""]
    trow ["580", "E103", "582", "580", "E103", "E103", "6C53", "0", "", ""]
    trow ["582", "E303", "583", "582", "E303", "E303", "6C53", "0", "", ""]
    trow ["583", "E003", "584", "583", "E003", "E003", "6C53", "0", "", ""]
    trow ["584", "CD7F", "57C", "57F", "CD7F", "057C", "6C53", "0", "", ""]
    trow ["57C", "000B", "57E", "00B", "000B", "0000", "6C53", "0", "00B", "0000"]
    trow ["57E", "F000", "57F", "57E", "F000", "F000", "6C53", "0", "", ""]
    raw "\\end{tabular}"
    raw "\\end{adjustbox}"
